Table of Contents
 Enum ConcreteMemberType
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Member type
public enum ConcreteMemberType
Fields
Beam = 1
Beam
BeamSlab = 4
Beam slab
Column = 2
Column
HollowCoreSlab = 8
Hollw core slab
NoDefined = 0
Not defined
Plate = 32
Plate
TwoWaySlab = 16
2-way slab
Wall = 64
Wall
Fields
 Name |  Description
 Beam = 1
Beam
 BeamSlab = 4
Beam slab
 Column = 2
Column
 HollowCoreSlab = 8
Hollw core slab
 NoDefined = 0
Not defined
 Plate = 32
Plate
 TwoWaySlab = 16
2-way slab
 Wall = 64
Wall
 Edit this page